SunCity/src/Enums/ХозяйственныеОперации/ХозяйственныеОперации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ХозяйственныеОперации</name>
  <enumValues>
    <name>ВнутренняяПередачаДенежныхСредств</name>
  </enumValues>
  <enumValues>
    <name>ВозвратДенежныхСредствОтПоставщика</name>
  </enumValues>
  <enumValues>
    <name>ВозвратОплатыКлиенту</name>
  </enumValues>
  <enumValues>
    <name>ВозвратОтПокупателя</name>
  </enumValues>
  <enumValues>
    <name>ВозвратПоставщику</name>
  </enumValues>
  <enumValues>
    <name>ВыдачаДенежныхСредствВДругуюКассу</name>
  </enumValues>
  <enumValues>
    <name>ВыдачаДенежныхСредствВДругуюОрганизацию</name>
  </enumValues>
  <enumValues>
    <name>ВыдачаДенежныхСредствВКассуККМ</name>
  </enumValues>
  <enumValues>
    <name>ВыдачаДенежныхСредствИзКассыККМ</name>
  </enumValues>
  <enumValues>
    <name>ВыплатаЗаработнойПлатыПоВедомостям</name>
  </enumValues>
  <enumValues>
    <name>ВыплатаЗаработнойПлатыРаботнику</name>
  </enumValues>
  <enumValues>
    <name>ЗакупкаВСтранахЕАЭС</name>
  </enumValues>
  <enumValues>
    <name>ЗакупкаПоИмпорту</name>
  </enumValues>
  <enumValues>
    <name>КомплектацияНоменклатуры</name>
  </enumValues>
  <enumValues>
    <name>КонвертацияВалюты</name>
  </enumValues>
  <enumValues>
    <name>ОплатаПоставщику</name>
  </enumValues>
  <enumValues>
    <name>Оприходование</name>
  </enumValues>
  <enumValues>
    <name>ОприходованиеПоИнвентаризации</name>
  </enumValues>
  <enumValues>
    <name>ОтгрузкаНаВнутренниеНужды</name>
  </enumValues>
  <enumValues>
    <name>ПередачаТоваровДоРеализации</name>
  </enumValues>
  <enumValues>
    <name>ПередачаТоваровПослеРеализации</name>
  </enumValues>
  <enumValues>
    <name>ПеремещениеТоваров</name>
  </enumValues>
  <enumValues>
    <name>ПересортицаТоваров</name>
  </enumValues>
  <enumValues>
    <name>ПересортицаТоваровСПереоценкой</name>
  </enumValues>
  <enumValues>
    <name>ПогашениеПодарочныхСертификатов</name>
  </enumValues>
  <enumValues>
    <name>ПоступлениеДенежныхСредствИзБанка</name>
  </enumValues>
  <enumValues>
    <name>ПоступлениеДенежныхСредствИзДругойКассы</name>
  </enumValues>
  <enumValues>
    <name>ПоступлениеДенежныхСредствИзДругойОрганизации</name>
  </enumValues>
  <enumValues>
    <name>ПоступлениеДенежныхСредствИзКассыККМ</name>
  </enumValues>
  <enumValues>
    <name>ПоступлениеОплатыОтКлиента</name>
  </enumValues>
  <enumValues>
    <name>ПоступлениеТоваров</name>
  </enumValues>
  <enumValues>
    <name>ПриемТоваровОтДругойОрганизации</name>
  </enumValues>
  <enumValues>
    <name>ПрочиеДоходы</name>
  </enumValues>
  <enumValues>
    <name>ПрочиеРасходы</name>
  </enumValues>
  <enumValues>
    <name>РеализацияТоваров</name>
  </enumValues>
  <enumValues>
    <name>СдачаДенежныхСредствВБанк</name>
  </enumValues>
  <enumValues>
    <name>СписаниеНаЗатраты</name>
  </enumValues>
  <enumValues>
    <name>СписаниеПоИнвентаризации</name>
  </enumValues>
  <enumValues>
    <name>ПриемНаКомиссию</name>
  </enumValues>
  <enumValues>
    <name>ВозвратТоваровКомитенту</name>
  </enumValues>
  <enumValues>
    <name>ОприходованиеКомиссионныхТоваров</name>
  </enumValues>
  <enumValues>
    <name>ВознаграждениеОтКомитента</name>
  </enumValues>
  <enumValues>
    <name>КорректировкаВыручки</name>
  </enumValues>
</mdclass:Enum>

SunCity/src/Enums/ВариантыВеденияДополнительныхДанныхПоНоменклатуре/ВариантыВеденияДополнительныхДанныхПоНоменклатуре.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВариантыВеденияДополнительныхДанныхПоНоменклатуре</name>
  <enumValues>
    <name>НеИспользовать</name>
  </enumValues>
  <enumValues>
    <name>ОбщиеДляВидаНоменклатуры</name>
  </enumValues>
  <enumValues>
    <name>ИндивидуальныеДляНоменклатуры</name>
  </enumValues>
</mdclass:Enum>

SunCity/src/Documents/УведомлениеОВвозеИзЕАЭСИСМПТК/УведомлениеОВвозеИзЕАЭСИСМПТК.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>УведомлениеОВвозеИзЕАЭСИСМПТК</name>
  <posting>Deny</posting>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DefinedType.ОснованиеУведомлениеОВвозеИСМПТК</types>
    </type>
  </attributes>
  <attributes>
    <name>Идентификатор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерИСМПТ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВИСМПТ</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>DefinedType.ОрганизацияИСМПТК</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>DefinedType.КонтрагентИСМПТК</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипУведомления</name>
    <type>
      <types>EnumRef.ВидыДокументаИСМПТК</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоКорректировка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьСвязанноеУведомление</name>
    <type>
      <types>DocumentRef.УведомлениеОВвозеИзЕАЭСИСМПТК</types>
    </type>
  </attributes>
  <attributes>
    <name>РегистрационныйНомерСвязанногоУведомления</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>42</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСвязанногоУведомления</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьВидОперации</name>
    <type>
      <types>EnumRef.ХозяйственныеОперацииИСМПТК</types>
    </type>
  </attributes>
  <attributes>
    <name>Направление</name>
    <type>
      <types>EnumRef.НаправленияДокументовИСМПТК</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыДокументовИСМПТК</types>
    </type>
  </attributes>
  <attributes>
    <name>Состояние</name>
    <type>
      <types>EnumRef.СостоянияДокументовИСМПТК</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВыпискиНаБумажномНосителе</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РегНомерНаБумажномНосителе</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>DefinedType.ПоставщикПолучательИСМПТК</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоставщикНаименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>450</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПоставщикИдентификационныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>14</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Получатель</name>
    <type>
      <types>DefinedType.ОрганизацияИСМПТК</types>
    </type>
  </attributes>
  <attributes>
    <name>ПолучательНаименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>450</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПолучательИдентификационныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтранаОтправления</name>
    <comment>Страна отправления/экспорта</comment>
    <type>
      <types>DefinedType.СтраныМираИСМПТК</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаУплатыАкциза</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерКвитанцииАкциза</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаАкциза</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>DefinedType.ПользователиИСМПТК</types>
    </type>
  </attributes>
  <attributes>
    <name>ТоварнаяГруппа</name>
    <type>
      <types>EnumRef.ВидыПродукцииИСМПТК</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторВвозПервичный</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторВвозИсправленный</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>DefinedType.НоменклатураИСМПТК</types>
      </type>
    </attributes>
    <attributes>
      <name>ТНВЭД</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтранаПроизводства</name>
      <type>
        <types>DefinedType.СтраныМираИСМПТК</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерПозицииВДекларацииИлиЗаявлении</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>11</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоИсточник</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>EAN</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>256</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидПродукции</name>
      <type>
        <types>EnumRef.ВидыПродукцииИСМПТК</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Марки</name>
    <attributes>
      <name>КодМаркировки</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидУпаковки</name>
      <type>
        <types>EnumRef.ВидыУпаковокИСМПТК</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <comment>Количество потребительских упаковок</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>GTIN</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>14</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>DefinedType.НоменклатураИСМПТК</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоИсточник</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>EAN</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>256</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КодИдентификации</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидПродукции</name>
      <type>
        <types>EnumRef.ВидыПродукцииИСМПТК</types>
      </type>
    </attributes>
    <attributes>
      <name>GTINВерхнегоУровня</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>14</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Ошибки</name>
    <attributes>
      <name>Текст</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Поле</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДокументыСоответствия</name>
    <attributes>
      <name>ТипДокумента</name>
      <type>
        <types>EnumRef.ВидыДокументовОбязательнойСертификацииИСМПТК</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаДокумента</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерДокумента</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

SunCity/src/CommonModules/РаботаСДокументамиИСМПТККлиентПереопределяемый/Module.bsl
#Область СлужебныеПроцедурыИФункции

//СтруктураОтбора - должна содержать имя реквизита учетного документа и значение отбора.
//
Процедура ДополнитьСтруктуруОтбораПервичногоДокумента(СтруктураОтбора, ДокументИсточник, ДополнительныеПараметры = Неопределено) Экспорт
	
	//ИС МПТ
	Если ТипЗнч(ДокументИсточник.Ссылка) = Тип("ДокументСсылка.АктПриемаПередачиИСМПТК") Тогда 
		
	ИначеЕсли ТипЗнч(ДокументИсточник.Ссылка) = Тип("ДокументСсылка.УведомлениеОВвозеИзЕАЭСИСМПТК") Тогда 
			
	ИначеЕсли ТипЗнч(ДокументИсточник.Ссылка) = Тип("ДокументСсылка.УведомлениеОВвозеИзТретьихСтранИСМПТК") Тогда 
		
	//ИС ЦЭДМ
	ИначеЕсли ТипЗнч(ДокументИсточник.Ссылка) = Тип("ДокументСсылка.АктВнутреннегоПеремещенияИСЦЭДМ") Тогда
		
		Если ЗначениеЗаполнено(ДокументИсточник.СкладПоставщик) Тогда
			СтруктураОтбора.Вставить("СкладОтправитель", ДокументИсточник.СкладПоставщик);
		КонецЕсли;
		Если ЗначениеЗаполнено(ДокументИсточник.СкладПолучатель) Тогда
			СтруктураОтбора.Вставить("СкладПолучатель", ДокументИсточник.СкладПолучатель);
		КонецЕсли; 
		
	ИначеЕсли ТипЗнч(ДокументИсточник.Ссылка) = Тип("ДокументСсылка.УведомлениеОВвозеИзЕАЭСИСЦЭДМ") Тогда 
			
	ИначеЕсли ТипЗнч(ДокументИсточник.Ссылка) = Тип("ДокументСсылка.УведомлениеОВвозеИзТретьихСтранИСЦЭДМ") Тогда 
		
	//СУЗ
	ИначеЕсли ТипЗнч(ДокументИсточник.Ссылка) = Тип("ДокументСсылка.ЗаказКодовМаркировкиСУЗИСМПТК") Тогда
		
		Если Не ДополнительныеПараметры = Неопределено Тогда
			Если ДополнительныеПараметры.ИмяДокумента = "ЗаказПоставщику" Тогда
				
				МассивВидовОперации = Новый Массив();
				МассивВидовОперации.Добавить(ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ПоступлениеТоваров"));
				МассивВидовОперации.Добавить(ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ЗакупкаПоИмпорту"));
				МассивВидовОперации.Добавить(ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ПриемНаКомиссию"));
				
				СтруктураОтбора.Вставить("ХозяйственнаяОперация", МассивВидовОперации);
				
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьИмяФормыВыбораСтраны() Экспорт
	
	Возврат "ОбщаяФорма.ФормаВыбораЗначенияИзСпискаИСМПТК";
	//Возврат "Справочник.СтраныМира.ФормаВыбора";
	
КонецФункции

//Определяет параметры открытия общей формы ФормаВыбораЗначенияИзСпискаИСМПТК
//
Функция ПолучитьПараметрыОткрытияФормыВыбора(ИмяФормы) Экспорт
	
	ПараметрыФормы = Новый Структура();
	
	Если ИмяФормы = "ОбщаяФорма.ФормаВыбораЗначенияИзСпискаИСМПТК" Тогда
		ПараметрыФормы.Вставить("МножественныйВыбор", 		Ложь);
		ПараметрыФормы.Вставить("ЗначениеВыбораДляЗапроса", "Справочник.СтраныМира");
		ПараметрыФормы.Вставить("ЗаголовокФормы", 			НСтр("ru = 'Выбор страны'"));
		ПараметрыФормы.Вставить("ЗаголовокКолонкиТаблицы",  НСтр("ru = 'Страна'"));
	КонецЕсли;
	
	Возврат ПараметрыФормы;
	
КонецФункции

Функция ПолучитьИмяОбщейФормыПросмотрСпискаДокументов() Экспорт
	
	Возврат "ОбщаяФорма.ПросмотрСпискаДокументов";
	
КонецФункции

#КонецОбласти

#Область ДокументыИСМПТ

#Область ВводНаОсновании

Функция ПроверитьИмяДокументаПТУ(ИмяДокумента) Экспорт
	
	Если ИмяДокумента = "ПоступлениеТоваров" Тогда
		Возврат Истина;
	ИначеЕсли ТипЗнч(ИмяДокумента) = Тип("ДокументСсылка.ПоступлениеТоваров") Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

Функция ПолучитьИмяФормыДокументаИСМПТ(ДокументИсточник, ТипДокументаИСМПТ = Неопределено) Экспорт
	
	Если ТипЗнч(ДокументИсточник) = Тип("ДокументСсылка.ПоступлениеТоваров")	
		Или ТипЗнч(ДокументИсточник) = Тип("ДокументСсылка.ВозвратТоваровОтПокупателя")	
		 Тогда
		
		Если Не ТипДокументаИСМПТ = Неопределено
			И Не ТипДокументаИСМПТ = Тип("СписокЗначений") Тогда
			
			Если ТипДокументаИСМПТ = Тип("ДокументСсылка.АктПриемаПередачиИСМПТК") Тогда
				Возврат "Документ.АктПриемаПередачиИСМПТК.ФормаОбъекта";
			ИначеЕсли ТипДокументаИСМПТ = Тип("ДокументСсылка.УведомлениеОВвозеИзЕАЭСИСМПТК") Тогда
				Возврат "Документ.УведомлениеОВвозеИзЕАЭСИСМПТК.ФормаОбъекта";
			Иначе
		        Возврат "Документ.УведомлениеОВвозеИзТретьихСтранИСМПТК.ФормаОбъекта";
			КонецЕсли;
		КонецЕсли;
		
		Возврат "Документ.АктПриемаПередачиИСМПТК.ФормаОбъекта";
		
	ИначеЕсли ТипЗнч(ДокументИсточник) = Тип("ДокументСсылка.РеализацияТоваров")
		Или ТипЗнч(ДокументИсточник) = Тип("ДокументСсылка.ВозвратТоваровПоставщику") Тогда
		
		Возврат "Документ.АктПриемаПередачиИСМПТК.ФормаОбъекта";

	ИначеЕсли ТипЗнч(ДокументИсточник) = Тип("ДокументСсылка.ОприходованиеТоваров") Тогда

		Возврат "Документ.УведомлениеОВводеВОборотИСМПТК.ФормаОбъекта";

	ИначеЕсли ТипЗнч(ДокументИсточник) = Тип("ДокументСсылка.СписаниеТоваров") Тогда	

		Возврат "Документ.УведомлениеОВыводеИзОборотаИСМПТК.ФормаОбъекта";
		
	ИначеЕсли ТипЗнч(ДокументИсточник) = Тип("ДокументСсылка.ЗаказПоставщику") Тогда 

		Возврат "Документ.ЗаказКодовМаркировкиСУЗИСМПТК.ФормаОбъекта";
	КонецЕсли;
		
КонецФункции

#КонецОбласти

#Область ОбщегоНазначенияИСМПТ

Процедура ОбработкаОповещенияДокументыИСМПТ(Форма, ДокументСсылка, ИмяСобытия, Параметр, Источник) Экспорт
	
	Если ИмяСобытия = "ВыполненаЗаписьДокумента" Тогда
		Если ТипЗнч(Параметр) = Тип("Массив")
			И Не Параметр.Количество() = 0
			И ДокументСсылка = Параметр[0] Тогда
			Форма.Прочитать();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СозданиеДокумента

Процедура СоздатьДокументИСМПТПоОснованию(ДокументИсточник, ИмяКоманды = Неопределено) Экспорт
	
	Если ТипЗнч(ДокументИсточник) = Тип("ДокументСсылка.РеализацияТоваров") Тогда  
	  	
		Если ИмяКоманды = "СоздатьЭкспортЕАЭС"
			И ИнтеграцияИСМПТКПереопределяемый.ПроверитьКонтрагентаДляСхемыВзаимногоПризнанияИСМПТ(ДокументИсточник) Тогда
			
			СоздатьЭкспортЕАЭСИСМПТ(ДокументИсточник);
			
		ИначеЕсли ИмяКоманды = "СоздатьАППИсход"
			И НЕ ИнтеграцияИСМПТКПереопределяемый.КонтрагентНерезидент(ДокументИсточник) Тогда 
			
			СоздатьАППИсходящийИСМПТ(ДокументИсточник);
			
		ИначеЕсли ИмяКоманды = "СоздатьУведОВыводе"
			И НЕ ИнтеграцияИСМПТКПереопределяемый.КонтрагентНерезидент(ДокументИсточник) Тогда 
			
			СоздатьВыводИзОборотаИСМПТ(ДокументИсточник);
			
		Иначе				
			ТекстСообщения = НСтр("ru = 'Указанный контрагент не соответствует требованиям создаваемого документа ИС МПТ!'");
			ОбщегоНазначенияИСМПТККлиентСерверПереопределяемый.СообщитьПользователю(ТекстСообщения);
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(ДокументИсточник) = Тип("ДокументСсылка.ВозвратТоваровПоставщику") Тогда
		
		СоздатьАППИсходящийИСМПТ(ДокументИсточник);
		
	ИначеЕсли ТипЗнч(ДокументИсточник) = Тип("ДокументСсылка.ОприходованиеТоваров")
		Или ТипЗнч(ДокументИсточник) = Тип("ДокументСсылка.ВозвратТоваровОтПокупателя") Тогда  
		
		СоздатьВводВОборотИСМПТ(ДокументИсточник);
		
	ИначеЕсли ТипЗнч(ДокументИсточник) = Тип("ДокументСсылка.СписаниеТоваров") Тогда 
	
		СоздатьВыводИзОборотаИСМПТ(ДокументИсточник);
		
	ИначеЕсли ТипЗнч(ДокументИсточник) = Тип("ДокументСсылка.ЗаказПоставщику") Тогда
				
		СоздатьЗаказКМ(ДокументИсточник);
		
	ИначеЕсли ТипЗнч(ДокументИсточник) = Тип("ДокументСсылка.ПоступлениеТоваров") Тогда 
		
		Если ИмяКоманды = "СоздатьВвозЕАЭС" Тогда
			СоздатьВвозЕАЭСИСМПТ(ДокументИсточник);
		ИначеЕсли ИмяКоманды = "СоздатьВвозИмпорт" Тогда
			СоздатьВвозИмпортИСМПТ(ДокументИсточник);
		Иначе
			ТекстСообщения = НСтр("ru='Для документов: %СписокДокументов% не может быть введен указанный документ ИС МПТ.'");
			СтрокаПодстановки = Символы.ПС + ДокументИсточник + Символы.ПС;
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%СписокДокументов%", СтрокаПодстановки); 
			ОбщегоНазначенияИСМПТККлиентСерверПереопределяемый.СообщитьПользователю(ТекстСообщения);
		КонецЕсли;
				
	ИначеЕсли ТипЗнч(ДокументИсточник) = Тип("ДокументСсылка.УведомлениеОбОтгрузкеЕАЭСИСМПТК") Тогда 
		
		СоздатьПриемкаЕАЭСИСМПТ(ДокументИсточник);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура СоздатьЗаказКМ(Основание)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Основание", Основание);
	ОткрытьФорму("Документ.ЗаказКодовМаркировкиСУЗИСМПТК.ФормаОбъекта", ПараметрыФормы);
			
КонецПроцедуры

Процедура СоздатьВыводИзОборотаИСМПТ(Основание)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Основание", Основание);
	ОткрытьФорму("Документ.УведомлениеОВыводеИзОборотаИСМПТК.ФормаОбъекта", ПараметрыФормы);
			
КонецПроцедуры

Процедура СоздатьВводВОборотИСМПТ(Основание)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Основание", Основание);
	ОткрытьФорму("Документ.УведомлениеОВводеВОборотИСМПТК.ФормаОбъекта", ПараметрыФормы);
			
КонецПроцедуры

Процедура СоздатьАППИсходящийИСМПТ(Основание)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Основание", Основание);
	ОткрытьФорму("Документ.АктПриемаПередачиИСМПТК.ФормаОбъекта", ПараметрыФормы);
			
КонецПроцедуры

Процедура СоздатьВвозЕАЭСИСМПТ(Основание)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Основание", Основание);
	ОткрытьФорму("Документ.УведомлениеОВвозеИзЕАЭСИСМПТК.ФормаОбъекта", ПараметрыФормы);
			
КонецПроцедуры

Процедура СоздатьВвозИмпортИСМПТ(Основание)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Основание", Основание);
	ОткрытьФорму("Документ.УведомлениеОВвозеИзТретьихСтранИСМПТК.ФормаОбъекта", ПараметрыФормы);
			
КонецПроцедуры

Процедура СоздатьЭкспортЕАЭСИСМПТ(Основание)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Основание", Основание);
	ОткрытьФорму("Документ.УведомлениеОбЭкспортеЕАЭСИСМПТК.ФормаОбъекта", ПараметрыФормы);
		
КонецПроцедуры

Процедура СоздатьПриемкаЕАЭСИСМПТ(Основание)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Основание", Основание);
	ОткрытьФорму("Документ.УведомлениеОПриемкеЕАЭСИСМПТК.ФормаОбъекта", ПараметрыФормы);
			
КонецПроцедуры

#КонецОбласти

#Область ВыборДокумента

Функция ВыбратьДокументИСМПТПоОснованию(ДокументИсточник) Экспорт
	
	Если ТипЗнч(ДокументИсточник) = Тип("ДокументСсылка.ПоступлениеТоваров")
		ИЛИ ТипЗнч(ДокументИсточник) = Тип("ДокументСсылка.ВозвратТоваровОтПокупателя") Тогда 
		Возврат Истина;
	Иначе
		Возврат Ложь;
		
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#КонецОбласти  

#Область ДокументыИСЦЭДМ

#Область ВводНаОсновании

Функция ПолучитьИмяФормыДокументаИСЦЭДМ(ДокументИсточник, ТипДокументаИСЦЭДМ = Неопределено) Экспорт
	
	Если ТипЗнч(ДокументИсточник) = Тип("ДокументСсылка.ПоступлениеТоваров") Тогда
		
		// Для ПТУ, т.к. нет вида операции, не можем определить АПП или какой-то из Ввозов товаров ввели. 
		// Поэтому ориентируемся на связанный документ маркировки.
		Если Не ТипДокументаИСЦЭДМ = Неопределено
			И Не ТипДокументаИСЦЭДМ = Тип("СписокЗначений") Тогда
			
			Если ТипДокументаИСЦЭДМ = Тип("ДокументСсылка.АктПриемаПередачиИСЦЭДМ") Тогда
				Возврат "Документ.АктПриемаПередачиИСЦЭДМ.ФормаОбъекта";
			ИначеЕсли ТипДокументаИСЦЭДМ = Тип("ДокументСсылка.УведомлениеОВвозеИзЕАЭСИСЦЭДМ") Тогда
				Возврат "Документ.УведомлениеОВвозеИзЕАЭСИСЦЭДМ.ФормаОбъекта";
			Иначе
		        Возврат "Документ.УведомлениеОВвозеИзТретьихСтранИСЦЭДМ.ФормаОбъекта";
			КонецЕсли;
		КонецЕсли;
		
		Возврат "Документ.АктПриемаПередачиИСЦЭДМ.ФормаОбъекта";
		
	ИначеЕсли ТипЗнч(ДокументИсточник) = Тип("ДокументСсылка.РеализацияТоваров") 
		Или ТипЗнч(ДокументИсточник) = Тип("ДокументСсылка.ВозвратТоваровОтПокупателя")	
        Или ТипЗнч(ДокументИсточник) = Тип("ДокументСсылка.ВозвратТоваровПоставщику") Тогда
				
		Возврат "Документ.АктПриемаПередачиИСЦЭДМ.ФормаОбъекта";
		
	ИначеЕсли ТипЗнч(ДокументИсточник) = Тип("ДокументСсылка.ОприходованиеТоваров")
		Или ТипЗнч(ДокументИсточник) = Тип("ДокументСсылка.ВозвратТоваровОтПокупателя") Тогда
		
		Возврат "Документ.УведомлениеОВводеВОборотИСЦЭДМ.ФормаОбъекта";

	ИначеЕсли ТипЗнч(ДокументИсточник) = Тип("ДокументСсылка.СписаниеТоваров") 
		Или ТипЗнч(ДокументИсточник) = Тип("ДокументСсылка.РеализацияТоваров") Тогда	
		
		Возврат "Документ.УведомлениеОВыводеИзОборотаИСЦЭДМ.ФормаОбъекта";
		
	ИначеЕсли ТипЗнч(ДокументИсточник) = Тип("ДокументСсылка.ПеремещениеТоваров") 
		Или ТипЗнч(ДокументИсточник) = Тип("ДокументСсылка.ОрдерНаПеремещениеТоваров") Тогда
				
		Возврат "Документ.АктВнутреннегоПеремещенияИСЦЭДМ.ФормаОбъекта";
		
	КонецЕсли;
		
КонецФункции

#КонецОбласти

Процедура СоздатьДокументИСЦЭДМПоОснованию(ДокументИсточник, ИмяКоманды = Неопределено) Экспорт

	Если ТипЗнч(ДокументИсточник) = Тип("ДокументСсылка.РеализацияТоваров") Тогда	
		
		Если ИмяКоманды = "СоздатьАППИсход" Тогда
			СоздатьАППИсходящийИСЦЭДМ(ДокументИсточник);
		ИначеЕсли ИмяКоманды = "СоздатьУведОВыводе" Тогда
			СоздатьВыводИзОборотаИСЦЭДМ(ДокументИсточник);
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(ДокументИсточник) = Тип("ДокументСсылка.ВозвратТоваровПоставщику") Тогда
		
		СоздатьАППИсходящийИСЦЭДМ(ДокументИсточник);
		
	ИначеЕсли ТипЗнч(ДокументИсточник) = Тип("ДокументСсылка.ВозвратТоваровОтПокупателя") Тогда
		
		СоздатьВводВОборотИСЦЭДМ(ДокументИсточник);
		
	ИначеЕсли ТипЗнч(ДокументИсточник) = Тип("ДокументСсылка.ОприходованиеТоваров") Тогда
				
		СоздатьВводВОборотИСЦЭДМ(ДокументИсточник);
		
	ИначеЕсли ТипЗнч(ДокументИсточник) = Тип("ДокументСсылка.СписаниеТоваров") Тогда	
	
		СоздатьВыводИзОборотаИСЦЭДМ(ДокументИсточник);
		
	ИначеЕсли ТипЗнч(ДокументИсточник) = Тип("ДокументСсылка.ПеремещениеТоваров")
		Или ТипЗнч(ДокументИсточник) = Тип("ДокументСсылка.ОрдерНаПеремещениеТоваров") Тогда	
	
		СоздатьАктыПеремещенияИСЦЭДМ(ДокументИсточник);
	
	ИначеЕсли ТипЗнч(ДокументИсточник) = Тип("ДокументСсылка.ПоступлениеТоваров") 
		Или ТипЗнч(ДокументИсточник) = Тип("ДокументСсылка.ОтчетОПередачеКИОтНерезидентаРКИСЦЭДМ") Тогда
				
		Если ИмяКоманды = "СоздатьВвозЕАЭС_ЦЭДМ" Тогда
			СоздатьВвозЕАЭСИСЦЭДМ(ДокументИсточник);
		Иначе
			СоздатьВвозИмпортИСЦЭДМ(ДокументИсточник);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура СоздатьВыводИзОборотаИСЦЭДМ(Основание)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Основание", Основание);
	ОткрытьФорму("Документ.УведомлениеОВыводеИзОборотаИСЦЭДМ.ФормаОбъекта", ПараметрыФормы);
			
КонецПроцедуры

Процедура СоздатьВводВОборотИСЦЭДМ(Основание)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Основание", Основание);
	ОткрытьФорму("Документ.УведомлениеОВводеВОборотИСЦЭДМ.ФормаОбъекта", ПараметрыФормы);
			
КонецПроцедуры

Процедура СоздатьАППИсходящийИСЦЭДМ(Основание)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Основание", Основание);
	ОткрытьФорму("Документ.АктПриемаПередачиИСЦЭДМ.ФормаОбъекта", ПараметрыФормы);
			
КонецПроцедуры

Процедура СоздатьАктыПеремещенияИСЦЭДМ(Основание)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Основание", Основание);
	ОткрытьФорму("Документ.АктВнутреннегоПеремещенияИСЦЭДМ.ФормаОбъекта", ПараметрыФормы);
			
КонецПроцедуры

Процедура СоздатьВвозЕАЭСИСЦЭДМ(Основание)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Основание", Основание);
	ОткрытьФорму("Документ.УведомлениеОВвозеИзЕАЭСИСЦЭДМ.ФормаОбъекта", ПараметрыФормы);
			
КонецПроцедуры

Процедура СоздатьВвозИмпортИСЦЭДМ(Основание)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Основание", Основание);
	ОткрытьФорму("Документ.УведомлениеОВвозеИзТретьихСтранИСЦЭДМ.ФормаОбъекта", ПараметрыФормы);
			
КонецПроцедуры

#КонецОбласти

#Область ДокументыСУЗ_БМ

Функция ПодобратьНоменклатуруВЗаказ(Форма, УникальныйИдентификатор) Экспорт
	
	Объект = Форма.Объект;
	
	ПараметрЗаголовок = НСтр("ru = 'Подбор товаров в %Документ%'");
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ПараметрЗаголовок = СтрЗаменить(ПараметрЗаголовок, "%Документ%", Объект.Ссылка);
	Иначе
		ПараметрЗаголовок = СтрЗаменить(ПараметрЗаголовок, "%Документ%", НСтр("ru = 'Заказ на эмиссию кодов маркировки.'"));
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Организация", Объект.Организация);
	ПараметрыФормы.Вставить("Дата", 	   Объект.Дата);
	ПараметрыФормы.Вставить("Валюта", 	   РаботаСДокументамиИСМПТКПереопределяемый.ПолучитьВалютуРегламентированногоУчета());
	
	ПараметрыФормы.Вставить("РежимПодбораИспользоватьСкладыВТабличнойЧасти", Истина);
	ПараметрыФормы.Вставить("Документ", Объект.Ссылка);
	
	ПараметрыФормы.Вставить("РежимПодбораБезСуммовыхПараметров", Истина);
	
	ОткрытьФорму("Обработка.ПодборТоваров.Форма", ПараметрыФормы, Форма, УникальныйИдентификатор);
		
КонецФункции

Функция ПолучитьИмяФормыПодбораНоменклатуры() Экспорт
	
	Возврат "Обработка.ПодборТоваровВДокументПродажи.Форма.Форма";
		
КонецФункции

#КонецОбласти

#Область ФормаПодбораНоменклатурыИРегистрацииновыхШК

Процедура УстановитьЗначениеХарактеристикПоУмолчанию(Форма, Элемент, ИмяТаблицы = "ШтрихкодыНоменклатуры") Экспорт
	
	ТекущиеДанные = Форма.Элементы[ИмяТаблицы].ТекущиеДанные;
	
	Если Не ЗначениеЗаполнено(ТекущиеДанные.Номенклатура) Тогда
		Возврат;
	КонецЕсли;
	
	РеквизитыНоменклатуры = ОбщегоНазначенияИСМПТКВызовСервера.ЗначенияРеквизитовОбъекта(ТекущиеДанные.Номенклатура, Новый Структура("ЕдиницаИзмерения, ВидНоменклатуры"));
	
	Если ЗначениеЗаполнено(РеквизитыНоменклатуры.ВидНоменклатуры) Тогда
		
		Если ИнтеграцияИСМПТКПереопределяемый.ПроверитьИспользованиеХарактеристик() Тогда //Использование хар-к в целом в базе
			
			//Использование хар-к у номенклатуры выбора
			ИспользоватьХарактеристики = ИнтеграцияИСМПТКПереопределяемый.ЗначениеРеквизитаОбъекта(ТекущиеДанные.Номенклатура.ВидНоменклатуры, "ИспользованиеХарактеристик");
			
			Если ИспользоватьХарактеристики = ПредопределенноеЗначение("Перечисление.ВариантыВеденияДополнительныхДанныхПоНоменклатуре.НеИспользовать")
				ИЛИ ИспользоватьХарактеристики = ПредопределенноеЗначение("Перечисление.ВариантыВеденияДополнительныхДанныхПоНоменклатуре.ПустаяСсылка") Тогда
				
				ТекущиеДанные.ХарактеристикиИспользуются = Ложь;
			Иначе
				ТекущиеДанные.ХарактеристикиИспользуются = Истина;
			КонецЕсли;
			
		Иначе
			ТекущиеДанные.ХарактеристикиИспользуются = Ложь;
		КонецЕсли;
		
		Если Не ТекущиеДанные.ХарактеристикиИспользуются Тогда
			ТекущиеДанные.Характеристика = Неопределено;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
